scripts/dev/cold_plate/heat_flux_verification/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

// Tolerances sit well above round-off (rung 1 found 1e-12 made the pressure
// solver hit its iteration cap on every outer iteration).
solvers
{
    p { solver GAMG; smoother GaussSeidel; tolerance 1e-9; relTol 0.01; }
    U { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-10; relTol 0.01; }
    T { solver PBiCGStab; preconditioner DILU; tolerance 1e-10; relTol 0; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;
    residualControl { p 1e-7; U 1e-8; }
}
relaxationFactors { equations { U 0.9; } }
